#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-x1RgwE1SvzKjHGTN

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.worker_user_data: Refreshing state... [id=c6c2cc78eb9c4f026324c659f366f7412e0c00adc58266553d8a47ad2362166c]
data.aws_iam_policy_document.imagebuilder_prod: Refreshing state... [id=2377160203]
data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
data.aws_iam_policy_document.spotfleet_iam_role_policy: Refreshing state... [id=1116480091]
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
data.aws_iam_policy_document.imagebuilder_stage: Refreshing state... [id=1407615633]
aws_s3_bucket.imagebuilder_stage: Refreshing state... [id=imagebuilder-service-stage]
aws_iam_user.imagebuilder_prod: Refreshing state... [id=imagebuilder-prod]
aws_iam_user.imagebuilder_stage: Refreshing state... [id=imagebuilder-stage]
aws_s3_bucket.imagebuilder_prod: Refreshing state... [id=imagebuilder-service-prod]
data.aws_iam_policy_document.vmimport_s3: Refreshing state... [id=1089363423]
data.aws_iam_policy_document.vmimport_trust: Refreshing state... [id=4085548158]
data.aws_vpc.external_vpc: Refreshing state... [id=vpc-78468405]
data.aws_caller_identity.current: Refreshing state... [id=933752197999]
data.aws_iam_policy_document.spotfleet_iam_spot_policy: Refreshing state... [id=3859824236]
data.aws_iam_policy_document.vmimport_ec2: Refreshing state... [id=315687832]
aws_iam_policy.imagebuilder_prod_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-prod-workers-s3]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=SpotFleetTaggingRoleForImageBuilder]
aws_iam_policy.imagebuilder_stage_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-stage-workers-s3]
aws_iam_role.vmimport: Refreshing state... [id=vmimport]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2]
aws_iam_user_policy_attachment.imagebuilder_prod_s3: Refreshing state... [id=imagebuilder-prod-20201113204258223300000001]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=SpotFleetTaggingRoleForImageBuilder-20201116214520726700000002]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport-20201116212912128900000002]
aws_iam_user_policy_attachment.imagebuilder_stage_vmimport: Refreshing state... [id=imagebuilder-stage-20201116212912312400000004]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport-20201116212912375000000005]
aws_iam_user_policy_attachment.imagebuilder_prod_vmimport: Refreshing state... [id=imagebuilder-prod-20201116212912287200000003]
aws_iam_user_policy_attachment.imagebuilder_stage_s3: Refreshing state... [id=imagebuilder-stage-20201113204258227600000002]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=SpotFleetTaggingRoleForImageBuilder-20201116214520746100000003]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_security_group.allow_ssh: Refreshing state... [id=sg-04c3b57abc095a9ab]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]
aws_security_group.allow_icmp: Refreshing state... [id=sg-01794fd088245ef29]
data.aws_subnet_ids.external_subnets: Refreshing state... [id=vpc-78468405]
aws_launch_template.worker_x86: Refreshing state... [id=lt-0cbb229d67d85ee00]
aws_spot_fleet_request.imagebuilder_worker_x86: Refreshing state... [id=sfr-a89f0a62-04d1-4506-8df5-f8065d14ca8f]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_iam_policy.spotfleet_iam_spot_policy will be updated in-place
  ~ resource "aws_iam_policy" "spotfleet_iam_spot_policy" {
        arn    = "arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy"
        id     = "arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy"
        name   = "spotfleet_iam_spot_policy"
        path   = "/"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            "ec2:RunInstances",
                          - "ec2:RequestSpotInstances",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeInstanceStatus",
                          - "ec2:DescribeImages",
                          + "ec2:RequestSpotFleet",
                          + "ec2:ModifySpotFleetRequest",
                          + "ec2:DescribeSpotFleetRequests",
                          + "ec2:DescribeSpotFleetRequestHistory",
                          + "ec2:DescribeSpotFleetInstances",
                          + "ec2:CreateTags",
                          + "ec2:CancelSpotFleetRequests",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                      ~ Sid      = "1" -> ""
                    },
                  ~ {
                        Action    = "iam:PassRole"
                      - Condition = {
                          - StringEquals = {
                              - iam:PassedToService = [
                                  - "ec2.amazonaws.com.cn",
                                  - "ec2.amazonaws.com",
                                ]
                            }
                        } -> null
                        Effect    = "Allow"
                      ~ Resource  = "*" -> "arn:aws:iam::*:role/aws-ec2-spot-fleet-tagging-role"
                      ~ Sid       = "2" -> ""
                    },
                  ~ {
                      ~ Action   = "ec2:CreateTags" -> [
                          + "iam:ListRoles",
                          + "iam:ListInstanceProfiles",
                          + "iam:CreateServiceLinkedRole",
                        ]
                        Effect   = "Allow"
                      ~ Resource = [
                          - "arn:aws:ec2:*:*:volume/*",
                          - "arn:aws:ec2:*:*:spot-instances-request/*",
                          - "arn:aws:ec2:*:*:spot-fleet-request/*",
                          - "arn:aws:ec2:*:*:instance/*",
                        ] -> "*"
                      ~ Sid      = "3" -> ""
                    },
                  - {
                      - Action    = "ec2:TerminateInstances"
                      - Condition = {
                          - StringLike = {
                              - ec2:ResourceTag/aws:ec2spot:fleet-request-id = "*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "4"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.spot_fleet_tagging_role must be replaced
+/- resource "aws_iam_role" "spot_fleet_tagging_role" {
      ~ arn                   = "arn:aws:iam::933752197999:role/SpotFleetTaggingRoleForImageBuilder" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "spotfleet.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-11-16T21:45:20Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "SpotFleetTaggingRoleForImageBuilder" -> (known after apply)
        max_session_duration  = 3600
      ~ name                  = "SpotFleetTaggingRoleForImageBuilder" -> "imagebuilder-spot-fleet-role" # forces replacement
        path                  = "/"
      - tags                  = {} -> null
      ~ unique_id             = "AROA5SZ7X2NXXEOBBBMV2" -> (known after apply)
    }

  # aws_iam_role_policy_attachment.spotfleet_iam_role_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "spotfleet_iam_role_policy" {
      ~ id         = "SpotFleetTaggingRoleForImageBuilder-20201116214520726700000002" -> (known after apply)
        policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2SpotFleetTaggingRole"
      ~ role       = "SpotFleetTaggingRoleForImageBuilder" -> "imagebuilder-spot-fleet-role" # forces replacement
    }

  # aws_iam_role_policy_attachment.spotfleet_iam_spot_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "spotfleet_iam_spot_policy" {
      ~ id         = "SpotFleetTaggingRoleForImageBuilder-20201116214520746100000003" -> (known after apply)
        policy_arn = "arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy"
      ~ role       = "SpotFleetTaggingRoleForImageBuilder" -> "imagebuilder-spot-fleet-role" # forces replacement
    }

  # aws_spot_fleet_request.imagebuilder_worker_x86 must be replaced
+/- resource "aws_spot_fleet_request" "imagebuilder_worker_x86" {
        allocation_strategy                 = "lowestPrice"
      ~ client_token                        = "terraform-20201116214520712900000001" -> (known after apply)
        excess_capacity_termination_policy  = "Default"
        fleet_type                          = "maintain"
      ~ iam_fleet_role                      = "arn:aws:iam::933752197999:role/SpotFleetTaggingRoleForImageBuilder" -> (known after apply) # forces replacement
      ~ id                                  = "sfr-a89f0a62-04d1-4506-8df5-f8065d14ca8f" -> (known after apply)
        instance_interruption_behaviour     = "terminate"
        instance_pools_to_use_count         = 1
      ~ load_balancers                      = [] -> (known after apply)
        replace_unhealthy_instances         = false
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder worker fleet"
            "ServiceOwner" = "Image Builder"
        }
        target_capacity                     = 1
      ~ target_group_arns                   = [] -> (known after apply)
        terminate_instances_with_expiration = true
        wait_for_fulfillment                = false

      - launch_template_config {
          - launch_template_specification {
              - id      = "lt-0cbb229d67d85ee00" -> null
              - version = "1" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config {
          + launch_template_specification {
              + id      = "lt-0cbb229d67d85ee00"
              + version = "1"
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*